<template>
  <Popup @close="triggerClose">
    <div class="popup__logo">
      <popup-logo />
    </div>
    <div class="popup__content">
      <h2 class="popup__header">
        Согласие на обработку персональных данных клиентов-физических лиц
      </h2>
      <p class="popup__description">
        Пользователь, оставляя заявку на интернет-сайте <a href="http://peresvet-ug.ru" target="_blank">http://peresvet-ug.ru</a>, принимает настоящее Согласие на обработку персональных данных (далее – Согласие). Действуя свободно, своей волей и в своем интересе, а также подтверждая свою дееспособность, Пользователь дает свое согласие ООО «Пересвет-Юг», ООО «Специализированный застройщик «Пересвет-Юг Профсоюзная», ООО «Специализированный застройщик «Пересвет-Юг Центральный», ООО «Специализированный застройщик «Квартал», ООО «Специализированный застройщик «Пересвет-Юг», которые расположены по адресу 400075, г. Волгоград, ул. им. 51-й Гвардейской Дивизии, 1Б, на обработку своих персональных данных со следующими условиями:
        <br>
        <br>
        1. Данное Согласие дается на обработку персональных данных, как без использования средств автоматизации, так и с их использованием.
        <br>
        2. Согласие дается на обработку следующих моих персональных данных: 1) Персональные данные, не являющиеся специальными или биометрическими: номера контактных телефонов; адреса электронной почты; фамилия, имя, отчество;
        <br>
        3. Персональные данные не являются общедоступными.
        <br>
        4. Цель обработки персональных данных: обработка входящих запросов физических лиц с целью оказания консультирования;
        <br>
        5. Основанием для обработки персональных данных является: ст. 24 Конституции Российской Федерации; ст.6 Федерального закона №152-ФЗ «О персональных данных»; Устав ООО «Пересвет-Юг», ООО «Специализированный застройщик «Пересвет-Юг Профсоюзная», ООО «Специализированный застройщик «Пересвет-Юг Центральный», ООО «Специализированный застройщик «Квартал», ООО «Специализированный застройщик «Пересвет-Юг»; настоящее согласие на обработку персональных данных.
        <br>
        6. В ходе обработки с персональными данными будут совершены следующие действия: сбор; запись; систематизация; накопление; хранение; уточнение (обновление, изменение); извлечение; использование; передача (распространение, предоставление, доступ); блокирование; удаление; уничтожение.
        <br>
        7. Обработка персональных данных может быть прекращена по запросу субъекта персональных данных. Хранение персональных данных, зафиксированных на бумажных носителях осуществляется согласно Федеральному закону №125-ФЗ «Об архивном деле в Российской Федерации» и иным нормативно правовым актам в области архивного дела и архивного хранения.
        <br>
        8. Согласие может быть отозвано субъектом персональных данных или его представителем путем направления письменного заявления ООО «Пересвет-Юг», ООО «Специализированный застройщик «Пересвет-Юг Профсоюзная», ООО «Специализированный застройщик «Пересвет-Юг Центральный», ООО «Специализированный застройщик «Квартал», ООО «Специализированный застройщик «Пересвет-Юг» или его представителю по адресу, указанному в начале данного Согласия.
        <br>
        9. В случае отзыва субъектом персональных данных или его представителем согласия на обработку персональных данных ООО «Пересвет-Юг», ООО «Специализированный застройщик «Пересвет-Юг Профсоюзная», ООО «Специализированный застройщик «Пересвет-Юг Центральный», ООО «Специализированный застройщик «Квартал», ООО «Специализированный застройщик «Пересвет-Юг» вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ «О персональных данных» от 27.07.2006 г.
        <br>
        10. Настоящее согласие действует все время до момента прекращения обработки персональных данных, указанных в п.7 и п.8 данного Согласия.
        <br>
      </p>
      <app-button alignment="baseline" text="Понятно" @click="triggerClose"/>
    </div>
  </Popup>
</template>

<script>
import Popup from './Popup.vue'
import PopupLogo from '~/assets/img/popup-logo.svg'
import AppButton from '~/components/Base/AppButton'

export default {
  name: 'SaveAppPopup',
  components: {
    Popup,
    PopupLogo,
    AppButton
  },
  methods: {
    triggerClose () {
      this.$emit('close')
    }
  }
}
</script>

<style lang="scss" scoped>
.popup {
  align-items: start;
  min-height: 100vh;
  &__logo {
    position: absolute;
    left: 40px;
    top: 37px;
    @include xl {
      width: 267.06px;
      height: 232.78px;
    }
    @include lg- {
      width: 95px;
      height: 82.81px;
      left: 30px;
      top: 27px;
    }
    @include xs {
      width: 57.36px;
      height: 50px;
      top: 12px;
      left: 17px;
    }
    svg {
      width: 100%;
      height: 100%;
    }
  }
  &__content {
    display: flex;
    flex-direction: column;
    margin-top: 180px;
    justify-content: center;
    max-width: 789px;
    padding: 0 10px;
    padding-bottom: 40px;
    padding-left: 40px;
    text-align: left;
    @include xl {
      margin-top: 382px;
      max-width: 2089px;
      padding-left: 40px;
      padding-bottom: 80px;
    }
    @include sm- {
      padding: 0 20px;
      margin-top: 90px;
      padding-bottom: 30px;
    }
  }
  &__header {
    font-weight: 700;
    font-size: 28px;
    line-height: 1.17;
    color: #fff;
    margin-bottom: 20px;
    @include xl {
      margin-bottom: 45px;
      font-size: 88px;
      line-height: 109.64px;
    }
    @include sm- {
      font-size: 24px;
    }
  }

  &__description {
    font-size: 12px;
    font-weight: 500;
    line-height: 1.75;
    color: #fff;
    margin-bottom: 36px;
    width: 100%;
    a {
        color: #E8B973;
        text-decoration: underline;
    }
    @include xl {
      font-size: 42px;
      line-height: 60px;
    }
    @include sm- {
      font-size: 10px;
    }
  }
  .app-button {
      max-width: 123px;
      font-size: 14px;
      line-height: 1;
      font-weight: 700;
      padding: 25px 5px;
      display: flex;
      justify-content: center;
      @include xl {
        font-size: 40px;
        line-height: 67.47px;
        max-width: max-content;
        padding: 53px 45px;
      }
      @include sm- {
        padding: 19px 3px;
      }
  }
}
</style>
